{
  "title": "High-Protein Chicken and Caramelized Onion Sandwiches with Fig, Apple and Arugula Salad",
  "time": "30 minutes",
  "ingredients": [
    {
      "name": "Chicken Breast",
      "quantity": "2"
    },
    {
      "name": "Arugula and Spinach Mix",
      "quantity": "1"
    },
    {
      "name": "Fig Jam",
      "quantity": "1"
    },
    {
      "name": "Artisan Bun",
      "quantity": "2"
    },
    {
      "name": "Pepitas",
      "quantity": "56g"
    },
    {
      "name": "Whole Grain Mustard",
      "quantity": "1"
    },
    {
      "name": "White Wine Vinegar",
      "quantity": "1 tbsp"
    },
    {
      "name": "Red Onion",
      "quantity": "113g"
    },
    {
      "name": "Gala Apple",
      "quantity": "250g"
    },
    {
      "name": "Oil",
      "quantity": "1 tbsp"
    },
    {
      "name": "Salt and Pepper",
      "quantity": "to taste"
    }
  ],
  "instructions": [
    "Before starting, preheat broiler to high and wash and dry all produce.",
    "Core, then cut apple into matchsticks. Halve buns. Whisk together vinegar, half the fig jam and 1 tbsp oil in a large bowl. Add apples and toss to combine.",
    "Peel, then cut the onion into 1/2-Inch slices. Heat a large non-stick pan over medium heat. When hot, add 1 tbsp oil, then onions. Cook until slightly softened, 3-4 min. Add remaining fig jam and season with salt. Cook, stirring occasionally, until the onions are dark golden-brown, 4-6 min. Carefully rinse and wipe pan clean.",
    "Season chicken breasts with salt and pepper. In the same pan, add another tbsp of oil and cook chicken until browned and cooked through. Remove from pan and let rest.",
    "Arrange bun halves, cut side up. Spread fig jam onto top buns. Slice cooked chicken and place on top of the fig jam. Bake in the middle of the oven, until buns are toasted, 3-5 min.",
    "While sandwiches toast, reheat same pan over medium. Add the pepitas to the dry pan. Toast, stirring often, until golden-brown, 3-4 min. Transfer to a plate.",
    "Add arugula and spinach mix and pepitas to the large bowl with apples and dressing. Toss to combine. Season with salt and pepper.",
    "Top chicken with caramelized onions and top buns. Cut sandwiches in half. Divide sandwiches and salad between plates."
  ],
  "allergens": [
    "egg",
    "fish",
    "crustacean",
    "shellfish",
    "mustard",
    "peanuts",
    "sesame",
    "soy",
    "sulphites",
    "tree nuts",
    "wheat"
  ]
}