{
  "title": "Falafel Pasta",
  "description": "Falafel Pasta with Roasted Tomatoes, Olives and Feta",
  "duration": "30 minutes",
  "servings": {
    "2 person": {
      "falafel": "8",
      "israeli couscous": "1/2 cup",
      "mixed olives": "30g",
      "baby tomatoes": "227g",
      "garlic": "3g",
      "feta cheese": "1/2 cup",
      "zucchini": "200g",
      "red wine vinegar": "1 tbsp",
      "lemon": "1",
      "cilantro": "7g",
      "parsley": "7g",
      "sugar": "1/2 tsp",
      "oil": "as needed",
      "salt and pepper": "as needed"
    },
    "4 person": {
      "falafel": "16",
      "israeli couscous": "1 1/2 cup",
      "mixed olives": "60g",
      "baby tomatoes": "454g",
      "garlic": "6g",
      "feta cheese": "1 cup",
      "zucchini": "400g",
      "red wine vinegar": "2 tbsp",
      "lemon": "1",
      "cilantro": "14g",
      "parsley": "14g",
      "sugar": "1 tsp",
      "oil": "as needed",
      "salt and pepper": "as needed"
    }
  },
  "instructions": [
    "Before starting, preheat the oven to 450°F. Wash and dry all produce.",
    "Add 10 cups hot water and 2 tsp salt to a large pot. Cover and bring to a boil over high heat. While water comes to a boil, peel, then mince or grate the garlic. Cut the zucchini into 1/2-inch rounds. On a parchment-lined baking sheet, toss tomatoes, zucchini and half the garlic with 1 tbsp oil. Season with salt and Pepper. Roast in the top of the oven, stirring halfway through cooking, 20-22 min.",
    "Add couscous to the large pot of boiling water. Cook, uncovered, until couscous is tender, 6-7 min. When couscous is tender, drain and return to the same pot, off the heat.",
    "Toss the falafel with 1 tbsp oil on another baking sheet. Roast in the middle of the oven, flipping the falafel halfway through cooking, until golden-brown, 10-12 min.",
    "Whisk together vinegar, remaining garlic, 2 tbsp oil, 4 1/2 tbsp lemon juice and 2 tsp sugar in a small bowl. Season with salt and pepper.",
    "Roughly chop parsley and cilantro. Roughly chop the olives. Juice half the lemon. Cut any remaining lemon into wedges.",
    "Add roasted veggies, dressing, cilantro, half the parsley and half the feta to the pot with the couscous. Toss to combine. Divide couscous between plates. Top with the falafel. Sprinkle with the olives, remaining parsley and remaining feta. Squeeze over a lemon wedge, if desired."
  ],
  "notes": "Ingredients are packaged in a facility that also handles egg, fish, crustacean, shellfish, milk, mustard, peanuts, sesame, soy, sulphites, tree nuts and wheat.",
  "contact": {
    "share": "#HelloFreshLife",
    "phone": "(855) 272-7002",
    "email": "hello@hellofresh.ca",
    "website": "HelloFresh.ca"
  }
}