{
  "recipe": {
    "name": "Fattoush Salad with Roasted Chickpeas",
    "description": "A flavorful salad featuring spiced pita and feta cheese, topped with roasted chickpeas.",
    "prep_time": "30 minutes",
    "cuisine": "Veggie",
    "ingredients": {
      "2_person": {
        "chickpeas": "398 ml",
        "shawarma_spice_blend": "1 tbsp",
        "garlic": "6g",
        "pita_bread": "2",
        "baby_tomatoes": "113g",
        "parsley": "14g",
        "mixed_olives": "30g",
        "green_onions": "2",
        "white_wine_vinegar": "2 tbsp",
        "sweet_bell_pepper": "160 g",
        "feta_cheese": "½ cup",
        "sugar": "1 tsp",
        "oil": "1 tbsp",
        "salt_and_pepper": "to taste"
      },
      "4_person": {
        "chickpeas": "796 ml",
        "shawarma_spice_blend": "2 tbsp",
        "garlic": "12g",
        "pita_bread": "2",
        "baby_tomatoes": "227 g",
        "parsley": "14g",
        "mixed_olives": "60g",
        "green_onions": "2",
        "white_wine_vinegar": "4 tbsp",
        "sweet_bell_pepper": "320 g",
        "feta_cheese": "1 cup",
        "sugar": "2 tsp",
        "oil": "2 tbsp",
        "salt_and_pepper": "to taste"
      }
    },
    "tools": [
      "2 baking sheets",
      "measuring spoons",
      "strainer",
      "aluminum foil",
      "large bowl",
      "parchment paper",
      "whisk"
    ],
    "instructions": [
      "Preheat the oven to 425°F.",
      "Wash and dry all produce.",
      "Drain and rinse chickpeas. Toss chickpeas with half the Shawarma Spice Blend and 1 tbsp oil (double for 4 people) on a parchment-lined baking sheet. Season with salt and pepper.",
      "Peel garlic and toss with ½ tsp oil (double for 4 people) on a small sheet of foil. Wrap tightly and place on the same baking sheet.",
      "Roast chickpeas and garlic in the middle of the oven, stirring chickpeas halfway through cooking, until golden-brown, 28-30 minutes.",
      "Remove roasted garlic cloves to a large bowl. Using a fork, mash cloves. Whisk in vinegar, 1 tsp sugar, 2 tbsp oil and 1 tbsp water (double all for 4 people). Season with salt and pepper.",
      "While chickpeas and garlic roast, cut pita into 1-inch pieces. Toss pita with remaining Shawarma Spice Blend and 1 tbsp oil (double for 4 people) on another parchment-lined baking sheet. Season with salt and pepper. Bake in the top of the oven until golden-brown and crisp, 4-5 minutes.",
      "Halve tomatoes, thinly slice green onions, core and cut pepper into ½-inch pieces, and roughly chop olives and parsley.",
      "Add roasted chickpeas, green onions, tomatoes, peppers, parsley, olives and half the feta to the bowl with dressing. Toss together.",
      "Divide pitas between bowls and top with the chickpea mixture. Sprinkle remaining feta over top."
    ]
  }
}